Revit 2017 API
ExternalServices.BuiltInExternalServices Properties
The ExternalServices.BuiltInExternalServices type exposes the following members.
Properties
Name | Description
CodeCheckingParameterService
 The external service supporting view and modification of the structural code checking parameter in analytical elements.
ConnectionTypeChangedService
 The external service used to notify when structural connection changed the type.
DirectContext3DService
 The external service supporting drawing not Revit models using third party API.
DuctFittingAndAccessoryPressureDropService
 The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropServer.
DuctFittingAndAccessoryPressureDropUIService
 The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropUIServer.
DuctPressureDropService
 The external service which permits registration of an alternate implementation for duct pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctPressureDropServer.
ExternalResourceService
 The external service Id which permits registration of an alternate servers for managing external resources such as linked files.
ExternalResourceUIService
 The external UI service Id which permits registration of an alternate servers for managing error messages which happen at the loading of the references to external resources such as linked files.
FramingProfileService
 The external service responsible for the generation of the fabrication profile.
IFCExporterService
 The external service which permits registration of an alternate implementation for IFC export.
IFCImporterService
 The external service which permits registration of an alternate implementation for IFC import.
MemberForcesService
 The external service supporting view and modification of the member forces in analytical elements.
ModifyConnectionParametersService
 The external service to view and modify structural connection parameters.
NavisworksExporterService
 The external service which supports export of the model to Navisworks.
PipeFittingAndAccessoryPressureDropService
 The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropServer.
PipeFittingAndAccessoryPressureDropUIService
 The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer.
PipePlumbingFixtureFlowService
 The external service which permits registration of an alternate implementation for pipe fixture flow calculation. To use this service, programmers implement a server class that derives from IPipePlumbingFixtureFlowServer.
PipePressureDropService
 The external service which permits registration of an alternate implementation for pipe pressure drop calculation. To use this service, programmers implement a server class that derives from IPipePressureDropServer.
SnappingService
SteelConnectionsService
StructuralSectionsService
 The external service supporting view and modification of the structural sections shape in structural elements.
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace